AliRezaJoodi/STM32_Exercises/_ExtraDrivers/Inc/stm32f1xx_bm_adc.h
// GitHub Account: GitHub.com/AliRezaJoodi
// Bare Metal Programming

/*
It's about:
	ADC_SR:			ADC status register
	ADC_JDRx:		ADC injected data register x
	ADC_DR:			ADC regular data register
	ADC_CR1:		ADC control register 1
	ADC_CR2:		ADC control register 2
	ADC_SQR1:		ADC regular sequence register 1
	ADC_SQR2:		ADC regular sequence register 2
	ADC_SQR3:		ADC regular sequence register 3
	ADC_SMPR1: 	ADC sample time register 1
	ADC_SMPR2: 	ADC sample time register 2
*/

/*
Abbreviations:
	ADC:	Analog to digital converter
*/

#ifndef _STM32F1XX_BM_ADC_INCLUDED
#define _STM32F1XX_BM_ADC_INCLUDED

#ifdef __cplusplus
extern "C" {
#endif

#include <stm32f1xx.h>
#include <utility.h>
#include <timeout.h>
#include <stm32f1xx_bm_bus.h>
#include <stm32f1xx_bm_timer_systick.h>

#define ADC_SUCCESS		0
#define ADC_ERROR			1

/*
Power-up time
tSTAB:	1uS
*/
#ifndef ADC_TSTAB
	#define ADC_TSTAB		1
#endif

#ifndef ADC_GAIN
	#define ADC_GAIN		0.80586080    // 3300mv / 2^10 = 3300/4095
#endif

/*
V25 = VSENSE value for 25° C and	
unit: mv
*/	
#ifndef ADC_V25
	#define ADC_V25        1430
#endif

/*
Avg_Slope = Average Slope for curve between Temperature and VSENSE.
unit: mv
*/
#ifndef ADC_AVG_SLOPE
	#define ADC_AVG_SLOPE  4.3
#endif


#define ADC_IN0			0
#define ADC_IN1			1
#define ADC_IN2			2
#define ADC_IN3			3
#define ADC_IN4			4
#define ADC_IN5			5
#define ADC_IN6			6
#define ADC_IN7			7
#define ADC_IN8			8
#define ADC_IN9			9
#define ADC_IN10		10
#define ADC_IN11		11
#define ADC_IN12		12
#define ADC_IN13		13
#define ADC_IN14		14
#define ADC_IN15		15
#define ADC_IN16		16
#define ADC_IN17		17

#define ADC_TEMPSENSOR		ADC_IN16
#define ADC_VREFINT				ADC_IN17


/*
ADC_SR, Bit 4
STRT:	Regular channel Start flag
			This bit is set by hardware when regular channel conversion starts.
			It is cleared by software.
			0: No regular channel conversion started
			1: Regular channel conversion has started
*/

__STATIC_INLINE uint8_t ADC_StartFlagForRegularChannels_GetFlag(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->SR, ADC_SR_STRT_Pos) );
}

__STATIC_INLINE void ADC_StartFlagForRegularChannels_ClearFlag(ADC_TypeDef *ADCx){
	ClearBit(ADCx->SR, ADC_SR_STRT_Pos);
}


/*
ADC_SR, Bit 3
JSTRT: 	Injected channel Start flag
				This bit is set by hardware when injected channel group conversion starts.
				It is cleared by software.
				0: No injected group conversion started
				1: Injected group conversion has started
*/

__STATIC_INLINE uint8_t ADC_StartFlagForInjectedChannels_GetFlag(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->SR, ADC_SR_JSTRT_Pos) );
}

__STATIC_INLINE void ADC_StartFlagForInjectedChannels_ClearFlag(ADC_TypeDef *ADCx){
	ClearBit(ADCx->SR, ADC_SR_JSTRT_Pos);
}


/*
ADC_SR, Bit 2
JEOC:	Injected channel end of conversion
			This bit is set by hardware at the end of all injected group channel conversion.
			It is cleared by software.
			0: Conversion is not complete
			1: Conversion complete
*/

__STATIC_INLINE uint8_t ADC_EndOfConversionForInjectedChannels_GetFlag(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->SR, ADC_SR_JEOS_Pos) );
}

__STATIC_INLINE void ADC_EndOfConversionForInjectedChannels_ClearFlag(ADC_TypeDef *ADCx){
	ClearBit(ADCx->SR, ADC_SR_JEOS_Pos);
}


/*
ADC_SR, Bit 1
EOC:	End of conversion
			This bit is set by hardware at the end of a group channel conversion (regular or injected).
			It is cleared by software or by reading the ADC_DR.
			0: Conversion is not complete
			1: Conversion complete
*/

__STATIC_INLINE uint8_t ADC_EndOfConversion_GetFlag(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->SR, ADC_SR_EOS_Pos) );
}

__STATIC_INLINE void ADC_EndOfConversion_ClearFlag(ADC_TypeDef *ADCx){
	ClearBit(ADCx->SR, ADC_SR_EOS_Pos);
}


/*
ADC_SR, Bit 0
AWD:	Analog watchdog flag
			This bit is set by hardware when the converted voltage crosses the values programmed in
			the ADC_LTR and ADC_HTR registers.
			It is cleared by software.
			0: No Analog watchdog event occurred
			1: Analog watchdog event occurred
*/

__STATIC_INLINE uint8_t ADC_AnalogWatchdogFlag_GetFlag(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->SR, ADC_SR_AWD_Pos) );
}

__STATIC_INLINE void ADC_AnalogWatchdogFlag_ClearFlag(ADC_TypeDef *ADCx){
	ClearBit(ADCx->SR, ADC_SR_AWD_Pos);
}


/*
ADC_JDRx, Bits 15:0
JDATA[15:0]: Injected data
							These bits are read only.
							They contain the conversion result from injected channel x.
*/
// Need to check
__STATIC_INLINE uint16_t ADC_ConversionResultForInjectedChannels_ReadData(ADC_TypeDef *ADCx){
	uint16_t data = ADCx->JDR1 & 0xFFFFUL;
	return data;
}


/*
ADC_DR, Bits 31:16
ADC2DATA[15:0]: ADC2 data
								These bits are read only.
								In ADC1: In dual mode, these bits contain the regular data of ADC2.
								In ADC2 and ADC3: these bits are not used.					
*/

__STATIC_INLINE uint16_t ADC_ConversionResultInRegularChannelsWithDualMode_ReadData(void){
	uint16_t data = ((ADC1->DR) >> 16) & 0xFFFFUL;
	return data;
}


/*
ADC_DR, Bits 15:0
DATA[15:0]:	Regular data
						These bits are read only.
						They contain the conversion result from the regular channels.
*/

__STATIC_INLINE uint16_t ADC_ConversionResultForRegularChannels_ReadData(ADC_TypeDef *ADCx){
	uint16_t data = ADCx->DR & 0xFFFFUL;
	return data;
}


/*
ADC_CR1, Bit 23
AWDEN: 	Analog watchdog enable on regular channels
				This bit is set/reset by software.
				0: Analog watchdog disabled on regular channels
				1: Analog watchdog enabled on regular channels
*/

__STATIC_INLINE uint8_t _AnalogWatchdogOnRegularChannels_GetEnableStatus(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->CR1, ADC_CR1_AWDEN_Pos) );
}

__STATIC_INLINE uint8_t ADC_AnalogWatchdogOnRegularChannels_EnableOrDisable(ADC_TypeDef *ADCx, uint8_t status){
	WriteBit(ADCx->CR1, ADC_CR1_AWDEN_Pos, status);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_AnalogWatchdogOnRegularChannels_GetEnableStatus, ADCx, status);
	#else
		return 0;
	#endif
}


/*
ADC_CR1, Bit 22
JAWDEN: Analog watchdog enable on injected channels
				This bit is set/reset by software.
				0: Analog watchdog disabled on injected channels
				1: Analog watchdog enabled on injected channels
*/

__STATIC_INLINE uint8_t _AnalogWatchdogOnInjectedChannels_GetEnableStatus(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->CR1, ADC_CR1_JAWDEN_Pos) );
}

__STATIC_INLINE uint8_t ADC_AnalogWatchdogOnInjectedChannels_EnableOrDisable(ADC_TypeDef *ADCx, uint8_t status){
	WriteBit(ADCx->CR1, ADC_CR1_JAWDEN_Pos, status);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_AnalogWatchdogOnInjectedChannels_GetEnableStatus, ADCx, status);
	#else
		return 0;
	#endif
}


