AliRezaJoodi/STM32_Exercises/_ExtraDrivers/Inc/stm32f1xx_bm_adc.h
/*
ADC_CR1, Bits 19:16
DUALMOD[3:0]: Dual mode selection
							These bits are written by software to select the operating mode.
							0000: Independent mode.
							0001: Combined regular simultaneous + injected simultaneous mode
							0010: Combined regular simultaneous + alternate trigger mode
							0011: Combined injected simultaneous + fast interleaved mode
							0100: Combined injected simultaneous + slow Interleaved mode
							0101: Injected simultaneous mode only
							0110: Regular simultaneous mode only
							0111: Fast interleaved mode only
							1000: Slow interleaved mode only
							1001: Alternate trigger mode only

							Note: These bits are reserved in ADC2 and ADC3.
							In dual mode, a change of channel configuration generates a restart that can produce a loss of synchronization. 
							It is recommended to disable dual mode before any configuration change.
*/

#define ADC_INDEPENDENT				0b0000
#define ADC_DUAL_MODE1				0b0001
#define ADC_DUAL_MODE2				0b0010
#define ADC_DUAL_MODE3				0b0011
#define ADC_DUAL_MODE4				0b0100
#define ADC_DUAL_MODE5				0b0101
#define ADC_DUAL_MODE6				0b0110
#define ADC_DUAL_MODE7				0b0111
#define ADC_DUAL_MODE8				0b1000
#define ADC_DUAL_MODE9				0b1001

__STATIC_INLINE uint8_t _DualMode_GetMode(ADC_TypeDef *ADCx){
	return ( Get4Bit(ADCx->CR1, ADC_CR1_DUALMOD_Pos) );
}

__STATIC_INLINE uint8_t ADC_DualMode_SetMode(ADC_TypeDef *ADCx, uint8_t mode){
	Write4Bit(ADCx->CR1, ADC_CR1_DUALMOD_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_DualMode_GetMode, ADCx, mode);
	#else
		return 0;
	#endif
}


/*
ADC_CR1, 15:13
DISCNUM[2:0]: Discontinuous mode channel count
							These bits are written by software to define the number of regular channels_
							to be converted in discontinuous mode, after receiving an external trigger.
							000: 1 channel
							001: 2 channels
							.......
							111: 8 channels
*/

__STATIC_INLINE uint8_t _DiscontinuousModeForRegularChannels_GetChannelCount(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->CR1, ADC_CR1_DISCNUM_Pos) );
}

__STATIC_INLINE uint8_t ADC_DiscontinuousModeForRegularChannels_SetChannelCount(ADC_TypeDef *ADCx, uint8_t count){
	if(count<1 || 8<count){return 1;}
	
	Write3Bit(ADCx->CR1, ADC_CR1_DISCNUM_Pos, (count-1));
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_DiscontinuousModeForRegularChannels_GetChannelCount, ADCx, (count-1));
	#else
		return 0;
	#endif
}


/*
ADC_CR1, Bit 12
JDISCEN: 	Discontinuous mode on injected channels
					This bit set and cleared by software to enable/disable discontinuous mode on injected group channels
					0: Discontinuous mode on injected channels disabled
					1: Discontinuous mode on injected channels enabled
*/

__STATIC_INLINE uint8_t _DiscontinuousModeOnInjectedChannels_GetEnableStatus(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->CR1, ADC_CR1_JDISCEN_Pos) );
}

__STATIC_INLINE uint8_t ADC_DiscontinuousModeOnInjectedChannels_EnableOrDisable(ADC_TypeDef *ADCx, uint8_t status){
	WriteBit(ADCx->CR1, ADC_CR1_JDISCEN_Pos, status);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_DiscontinuousModeOnInjectedChannels_GetEnableStatus, ADCx, status);
	#else
		return 0;
	#endif
}


/*
ADC_CR1, Bit 11
DISCEN: Discontinuous mode on regular channels
				This bit set and cleared by software to enable/disable Discontinuous mode on regular channels.
				0: Discontinuous mode on regular channels disabled
				1: Discontinuous mode on regular channels enabled
*/

__STATIC_INLINE uint8_t _DiscontinuousModeForRegularChannels_GetEnableStatus(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->CR1, ADC_CR1_DISCEN_Pos) );
}

__STATIC_INLINE uint8_t ADC_DiscontinuousModeForRegularChannels_EnableOrDisable(ADC_TypeDef *ADCx, uint8_t status){
	WriteBit(ADCx->CR1, ADC_CR1_DISCEN_Pos, status);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_DiscontinuousModeForRegularChannels_GetEnableStatus, ADCx, status);
	#else
		return 0;
	#endif
}


/*
ADC_CR1, Bit 10
JAUTO: 	Automatic Injected Group conversion
				This bit set and cleared by software to enable/disable automatic injected group conversion after regular group conversion.
				0: Automatic injected group conversion disabled
				1: Automatic injected group conversion enabled
*/


/*
ADC_CR1, Bit 9
AWDSGL: Enable the watchdog on a single channel in scan mode
				This bit set and cleared by software to enable/disable the analog watchdog on the channel identified by the AWDCH[4:0] bits.
				0: Analog watchdog enabled on all channels
				1: Analog watchdog enabled on a single channel
*/


/*
ADC_CR1, Bit 8
SCAN: Scan mode
			This bit is set and cleared by software to enable/disable Scan mode.
			In Scan mode, the inputs selected through the ADC_SQRx or ADC_JSQRx registers are converted.
			0: Scan mode disabled
			1: Scan mode enabled

			Note: An EOC or JEOC interrupt is generated only on the end of conversion of the last
			channel if the corresponding EOCIE or JEOCIE bit is set
*/

__STATIC_INLINE uint8_t _ScanMode_GetEnableStatus(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->CR1, ADC_CR1_SCAN_Pos) );
}

__STATIC_INLINE uint8_t ADC_ScanMode_EnableOrDisable(ADC_TypeDef *ADCx, uint8_t status){
	WriteBit(ADCx->CR1, ADC_CR1_SCAN_Pos, status);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_ScanMode_GetEnableStatus, ADCx, status);
	#else
		return 0;
	#endif
}


/*
ADC_CR1, Bit 7
JEOCIE: Interrupt enable for injected channels
				This bit is set and cleared by software to enable/disable the end of conversion interrupt for injected channels.
				0: JEOC interrupt disabled
				1: JEOC interrupt enabled. An interrupt is generated when the JEOC bit is set.
*/


/*
ADC_CR1, Bit 6
AWDIE: Analog watchdog interrupt enable
			This bit is set and cleared by software to enable/disable the analog watchdog interrupt.
			0: Analog watchdog interrupt disabled
			1: Analog watchdog interrupt enabled
*/


/*
ADC_CR1, Bit 5
EOCIE: Interrupt enable for EOC
			This bit is set and cleared by software to enable/disable the End of Conversion interrupt.
			0: EOC interrupt disabled
			1: EOC interrupt enabled. An interrupt is generated when the EOC bit is set.
*/

