AliRezaJoodi/STM32_Exercises/_ExtraDrivers/Inc/stm32f1xx_bm_adc.h
__STATIC_INLINE uint8_t _InterruptForRegularChannels_GetEnableStatus(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->CR1, ADC_CR1_EOSIE_Pos) );
}

__STATIC_INLINE uint8_t ADC_InterruptForRegularChannels_EnableOrDisable(ADC_TypeDef *ADCx, uint8_t status){
	WriteBit(ADCx->CR1, ADC_CR1_EOSIE_Pos, status);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_InterruptForRegularChannels_GetEnableStatus, ADCx, status);
	#else
		return 0;
	#endif
}


/*
ADC_CR1, Bits 4:0
AWDCH[4:0]: Analog watchdog channel select bits
						These bits are set and cleared by software.
						They select the input channel to be guarded by the Analog watchdog.
						00000: ADC analog Channel 0
						00001: ADC analog Channel 1
						....
						01111: ADC analog Channel 15
						10000: ADC analog Channel 16
						10001: ADC analog Channel 17
						Other values: reserved.

						Note: ADC1 analog Channel 16 and Channel 17 are internally connected to the temperature
						sensor and to VREFINT, respectively.
						Note: ADC2 analog inputs Channel 16 and Channel 17 are internally connected to VSS.
						Note: ADC3 analog inputs Channel 9, Channel 14, Channel 15, Channel 16 and Channel 17 are connected to VSS.
*/


/*
ADC_CR2, Bit 23
TSVREFE: Temperature sensor and VREFINT enable
					This bit is set and cleared by software to enable/disable the temperature sensor and VREFINT channel.
					In devices with dual ADCs this bit is present only in ADC1.
					0: Temperature sensor and VREFINT channel disabled
					1: Temperature sensor and VREFINT channel enabled
*/

__STATIC_INLINE uint8_t _InternalChannels_GetStatus(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->CR2, ADC_CR2_TSVREFE_Pos) );
}

__STATIC_INLINE uint8_t ADC_InternalChannels_EnableOrDisable(uint8_t status){
	WriteBit(ADC1->CR2, ADC_CR2_TSVREFE_Pos, status);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_InternalChannels_GetStatus, ADC1, status);
	#else
		return 0;
	#endif
}


/*
ADC_CR2, Bit 22
SWSTART: 	Start conversion of regular channels
					This bit is set by software to start conversion and cleared by hardware as soon as conversion starts.
					It starts a conversion of a group of regular channels if SWSTART is selected as trigger event by the EXTSEL[2:0] bits.
					0: Reset state
					1: Starts conversion of regular channels
*/

__STATIC_INLINE uint8_t _SoftwareStartForRegularChannels_GetStatus(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->CR2, ADC_CR2_SWSTART_Pos) );
}

__STATIC_INLINE uint8_t ADC_SoftwareStartForRegularChannels_Start(ADC_TypeDef *ADCx){
	ADC_StartFlagForRegularChannels_ClearFlag(ADCx);
	ADC1->CR2 |= (ADC_CR2_SWSTART | ADC_CR2_EXTTRIG);
	//SetBit(ADCx->CR2, ADC_CR2_SWSTART_Pos);

	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(ADC_StartFlagForRegularChannels_GetFlag, ADCx, 1);
	#else
		return 0;
	#endif
}


/*
ADC_CR2, Bit 21
JSWSTART: Start conversion of injected channels
					This bit is set by software and cleared by software or by hardware as soon as the conversion starts.
					It starts a conversion of a group of injected channels (if JSWSTART is selected as trigger event by the JEXTSEL[2:0] bits.
					0: Reset state
					1: Starts conversion of injected channels
*/

__STATIC_INLINE uint8_t _StartConversionForInjectedChannels_GetStatus(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->CR2, ADC_CR2_JSWSTART_Pos) );
}

__STATIC_INLINE uint8_t ADC_StartConversionInInjectedChannels(ADC_TypeDef *ADCx){
	ADC_StartFlagForInjectedChannels_ClearFlag(ADCx);
	ADC1->CR2 |= (ADC_CR2_JSWSTART | ADC_CR2_JEXTTRIG);
	//SetBit(ADCx->CR2, ADC_CR2_JSWSTART_Pos);

	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(ADC_StartFlagForInjectedChannels_GetFlag, ADCx, 1);
	#else
		return 0;
	#endif
}


/*
ADC_CR2, Bit 20
EXTTRIG: 	External trigger conversion mode for regular channels
					This bit is set and cleared by software to enable/disable the external trigger used to start
					conversion of a regular channel group.
					0: Conversion on external event disabled
					1: Conversion on external event enabled
*/

__STATIC_INLINE uint8_t _ExternalTriggerForRegularChannels_GetEnableStatus(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->CR2, ADC_CR2_EXTTRIG_Pos) );
}

__STATIC_INLINE uint8_t ADC_ExternalTriggerForRegularChannels_EnableOrDisable(ADC_TypeDef *ADCx, uint8_t status){
	WriteBit(ADCx->CR2, ADC_CR2_EXTTRIG_Pos, status);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_ExternalTriggerForRegularChannels_GetEnableStatus, ADCx, status);
	#else
		return 0;
	#endif
}


/*
ADC_CR2,Bits 19:17
EXTSEL[2:0]: 	External event select for regular group
							These bits select the external event used to trigger the start of conversion of a regular group:
							For ADC1 and ADC2, the assigned triggers are:
							000: Timer 1 CC1 event
							001: Timer 1 CC2 event
							010: Timer 1 CC3 event
							011: Timer 2 CC2 event
							100: Timer 3 TRGO event
							101: Timer 4 CC4 event
							110: EXTI line 11/TIM8_TRGO event (TIM8_TRGO is available only in high-density and XLdensity devices)
							111: SWSTART

							For ADC3, the assigned triggers are:
							000: Timer 3 CC1 event
							001: Timer 2 CC3 event
							010: Timer 1 CC3 event
							011: Timer 8 CC1 event
							100: Timer 8 TRGO event
							101: Timer 5 CC1 event
							110: Timer 5 CC3 event
							111: SWSTART
*/

#define ADC_EXTSEL_TIM1_CH1			0b000
#define ADC_EXTSEL_TIM1_CH2			0b001
#define ADC_EXTSEL_TIM1_CH3			0b010
#define ADC_EXTSEL_TIM2_CH2			0b011
#define ADC_EXTSEL_TIM3_TRGO		0b100
#define ADC_EXTSEL_TIM4_CH4			0b101
#define ADC_EXTSEL_ETRGREG			0b110
#define ADC_EXTSEL_SOFTWARE			0b111 

#define ADC3_EXTSEL_TIM3_CH1		0b000
#define ADC3_EXTSEL_TIM2_CH3		0b001
#define ADC3_EXTSEL_TIM1_CH3		0b010
#define ADC3_EXTSEL_TIM8_CH1		0b011
#define ADC3_EXTSEL_TIM8_TRGO		0b100
#define ADC3_EXTSEL_TIM5_CH1		0b101
#define ADC3_EXTSEL_TIM5_CH3		0b110
#define ADC3_EXTSEL_SOFTWARE		0b111 

__STATIC_INLINE uint8_t _ExternalEventForRegularChannels_GetMode(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->CR2, ADC_CR2_EXTSEL_Pos) );
}

__STATIC_INLINE uint8_t ADC_ExternalEventForRegularChannels_SetMode(ADC_TypeDef *ADCx, uint8_t mode){
	Write3Bit(ADCx->CR2, ADC_CR2_EXTSEL_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_ExternalEventForRegularChannels_GetMode, ADCx, mode);
	#else
		return 0;
	#endif
}


