AliRezaJoodi/STM32_Exercises/_ExtraDrivers/Inc/stm32f1xx_bm_adc.h
/*
ADC_CR2, Bit 15
JEXTTRIG: External trigger conversion mode for injected channels
					This bit is set and cleared by software to enable/disable the external trigger used to start conversion of an injected channel group.
					0: Conversion on external event disabled
					1: Conversion on external event enabled
*/


/*
ADC_CR2, Bits 14:12
JEXTSEL[2:0]: External event select for injected group
							These bits select the external event used to trigger the start of conversion of an injected group:
							For ADC1 and ADC2 the assigned triggers are:
							000: Timer 1 TRGO event
							001: Timer 1 CC4 event
							010: Timer 2 TRGO event
							011: Timer 2 CC1 event
							100: Timer 3 CC4 event
							101: Timer 4 TRGO event
							110: EXTI line15/TIM8_CC4 event (TIM8_CC4 is available only in high-density and XLdensity devices)
							111: JSWSTART
							
							For ADC3 the assigned triggers are:
							000: Timer 1 TRGO event
							001: Timer 1 CC4 event
							010: Timer 4 CC3 event
							011: Timer 8 CC2 event
							100: Timer 8 CC4 event
							101: Timer 5 TRGO event
							110: Timer 5 CC4 event
							111: JSWSTART 
*/


/*
ADC_CR2, Bit 11
ALIGN: 	Data alignment
				This bit is set and cleared by software.
				0: Right Alignment
				1: Left Alignment
*/

#define ADC_ALIGNMENT_RIGHT		0
#define ADC_ALIGNMENT_LEFT		1

__STATIC_INLINE uint8_t _DataAlignment_GetStatus(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->CR2, ADC_CR2_ALIGN_Pos) );
}

__STATIC_INLINE uint8_t ADC_DataAlignment_SetLeftOrRight(ADC_TypeDef *ADCx, uint8_t status){
	WriteBit(ADCx->CR2, ADC_CR2_ALIGN_Pos, status);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_DataAlignment_GetStatus, ADCx, status);
	#else
		return 0;
	#endif
}


/*
ADC_CR2, Bit 8
DMA: 	Direct memory access mode
			This bit is set and cleared by software. Refer to the DMA controller chapter for more details.
			0: DMA mode disabled
			1: DMA mode enabled

			Note: Only ADC1 and ADC3 can generate a DMA request.
*/

__STATIC_INLINE uint8_t _DMA_GetEnableStatus(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->CR2, ADC_CR2_DMA_Pos) );
}

__STATIC_INLINE uint8_t ADC_DMA_EnableOrDisable(ADC_TypeDef *ADCx, uint8_t status){
	WriteBit(ADCx->CR2, ADC_CR2_DMA_Pos, status);
		
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_DMA_GetEnableStatus, ADCx, status);
	#else
		return 0;
	#endif
}


/*
ADC_CR2, Bit 3
RSTCAL: Reset calibration
				This bit is set by software and cleared by hardware. It is cleared after the calibration registers are initialized.
				0: Calibration register initialized.
				1: Initialize calibration register.

				Note: If RSTCAL is set when conversion is ongoing, additional cycles are required to clear the calibration registers.
*/


/*
ADC_CR2, Bit 2
CAL: 	A/D Calibration
			This bit is set by software to start the calibration.
			It is reset by hardware after calibration is complete.
			0: Calibration completed
			1: Enable calibration
*/

__STATIC_INLINE uint8_t _Calibration_GetCompleteStatus(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->CR2, ADC_CR2_CAL_Pos) );
}

__STATIC_INLINE uint8_t ADC_Calibration_Start(ADC_TypeDef *ADCx){
	SetBit(ADCx->CR2, ADC_CR2_CAL_Pos);
		
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_Calibration_GetCompleteStatus, ADCx, 0);
	#else
		return 0;
	#endif
}


/*
ADC_CR2, Bit 1
CONT: Continuous conversion
			This bit is set and cleared by software. If set conversion takes place continuously till this bit is reset.
			0: Single conversion mode
			1: Continuous conversion mode
*/

#define ADC_SINGLE				0b0
#define ADC_CONTINUOUS		0b1

__STATIC_INLINE uint8_t _ContinuousOrSingleMode_GetMode(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->CR2, ADC_CR2_CONT_Pos) );
}

__STATIC_INLINE uint8_t ADC_ContinuousOrSingleMode_SetMode(ADC_TypeDef *ADCx, uint8_t mode){
	WriteBit(ADCx->CR2, ADC_CR2_CONT_Pos, mode);

	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_ContinuousOrSingleMode_GetMode, ADCx, mode);
	#else
		return 0;
	#endif	
}


/*
ADC_CR2, Bit 0
ADON: A/D converter ON / OFF
			This bit is set and cleared by software.
			If this bit holds a value of zero and a 1 is written to it then it wakes up the ADC from Power Down state.
			Conversion starts when this bit holds a value of 1 and a 1 is written to it.
			The application should allow a delay of tSTAB between power up and start of conversion.
			0: Disable ADC conversion/calibration and go to power down mode.
			1: Enable ADC and to start conversion.

			Note: If any other bit in this register apart from ADON is changed at the same time, then conversion is not triggered. 
			This is to prevent triggering an erroneous conversion.

Note: When the ADON bit is set for the first time, it wakes up the ADC from Power Down mode.
Note: Conversion starts when ADON bit is set for a second time by software after ADC power-up time (tSTAB).
Note: tSTAB is 1uS
*/

__STATIC_INLINE uint8_t ADC_GetEnableStatus(ADC_TypeDef *ADCx){
	return ( GetBit(ADCx->CR2, ADC_CR2_ADON_Pos) );
}

__STATIC_INLINE uint8_t ADC_EnableOrDisable(ADC_TypeDef *ADCx, uint8_t status){
	switch (status){
		case 1:
			SetBit(ADCx->CR2, ADC_CR2_ADON_Pos);
			SysTick_Delay_1us(2);
			SetBit(ADCx->CR2, ADC_CR2_ADON_Pos);
			break;
		default:
			ClearBit(ADCx->CR2, ADC_CR2_ADON_Pos);
	}
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(ADC_GetEnableStatus, ADCx, status);
	#else
		return 0;
	#endif	
}


/*
ADC_SQR1, Bits 23:20
L[3:0]: Regular channel sequence length
				These bits are written by software to define the total number of conversions in the regular channel conversion sequence.
				0000: 1 conversion
				0001: 2 conversions
				.....
				1111: 16 conversions
*/

__STATIC_INLINE uint8_t _SequenceForRegularChannels_GetLength(ADC_TypeDef *ADCx){
	return ( Get4Bit(ADCx->SQR1, ADC_SQR1_L_Pos) );
}

__STATIC_INLINE uint8_t ADC_SequenceForRegularChannels_SetLength(ADC_TypeDef *ADCx, uint8_t length){
	if(length>16){return 1;}
		
	Write4Bit(ADCx->SQR1, ADC_SQR1_L_Pos, length-1);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SequenceForRegularChannels_GetLength, ADCx, length-1);
	#else
		return 0;
	#endif
}


