AliRezaJoodi/STM32_Exercises/_ExtraDrivers/Inc/stm32f1xx_bm_adc.h
/*
ADC_SQR1, Bits 19:15
SQ16[4:0]: 16th conversion in regular sequence

ADC_SQR1, Bits 14:10
SQ15[4:0]: 15th conversion in regular sequence

ADC_SQR1, Bits 9:5
SQ14[4:0]: 14th conversion in regular sequence

ADC_SQR1, Bits 4:0
SQ13[4:0]: 13th conversion in regular sequence

ADC_SQR2, Bits 29:25
SQ12[4:0]: 12th conversion in regular sequence

ADC_SQR2, Bits 24:20 
SQ11[4:0]: 11th conversion in regular sequence

ADC_SQR2, Bits 19:15
SQ10[4:0]: 10th conversion in regular sequence

ADC_SQR2, Bits 14:10 
SQ9[4:0]: 9th conversion in regular sequence

ADC_SQR2, Bits 9:5
SQ8[4:0]: 8th conversion in regular sequence

ADC_SQR2, Bits 4:0
SQ7[4:0]: 7th conversion in regular sequence

ADC_SQR3, Bits 29:25
SQ6[4:0]: 6th conversion in regular sequence

ADC_SQR3, Bits 24:20
SQ5[4:0]: 5th conversion in regular sequence

ADC_SQR3, Bits 19:15
SQ4[4:0]: 4th conversion in regular sequence

ADC_SQR3, Bits 14:10
SQ3[4:0]: 3rd conversion in regular sequence

ADC_SQR3, Bits 9:5
SQ2[4:0]: 2nd conversion in regular sequence

ADC_SQR3, Bits 4:0
SQ1[4:0]: first conversion in regular sequence

Note; These bits are written by software with the channel number (0..17) assigned as the 16th in the conversion sequence.
*/

__STATIC_INLINE uint8_t _SequenceForRegularChannels_Get16thSequence(ADC_TypeDef *ADCx){
	return ( Get5Bit(ADCx->SQR1, ADC_SQR1_SQ16_Pos) );
}

__STATIC_INLINE uint8_t ADC_SequenceForRegularChannels_Set16thSequence(ADC_TypeDef *ADCx, uint8_t ch){
	if(ch>17){return ADC_ERROR;}
		
	Write5Bit(ADCx->SQR1, ADC_SQR1_SQ16_Pos, ch);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SequenceForRegularChannels_Get16thSequence, ADCx, ch);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SequenceForRegularChannels_Get15thSequence(ADC_TypeDef *ADCx){
	return ( Get5Bit(ADCx->SQR1, ADC_SQR1_SQ15_Pos) );
}

__STATIC_INLINE uint8_t ADC_SequenceForRegularChannels_Set15thSequence(ADC_TypeDef *ADCx, uint8_t ch){
	if(ch>17){return ADC_ERROR;}
	
	Write5Bit(ADCx->SQR1, ADC_SQR1_SQ15_Pos, ch);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SequenceForRegularChannels_Get15thSequence, ADCx, ch);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SequenceForRegularChannels_Get14thSequence(ADC_TypeDef *ADCx){
	return ( Get5Bit(ADCx->SQR1, ADC_SQR1_SQ14_Pos) );
}

__STATIC_INLINE uint8_t ADC_SequenceForRegularChannels_Set14thSequence(ADC_TypeDef *ADCx, uint8_t ch){
	if(ch>17){return ADC_ERROR;}
	
	Write5Bit(ADCx->SQR1, ADC_SQR1_SQ14_Pos, ch);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SequenceForRegularChannels_Get14thSequence, ADCx, ch);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SequenceForRegularChannels_Get13thSequence(ADC_TypeDef *ADCx){
	return ( Get5Bit(ADCx->SQR1, ADC_SQR1_SQ13_Pos) );
}

__STATIC_INLINE uint8_t ADC_SequenceForRegularChannels_Set13thSequence(ADC_TypeDef *ADCx, uint8_t ch){
	if(ch>17){return ADC_ERROR;}
	
	Write5Bit(ADCx->SQR1, ADC_SQR1_SQ13_Pos, ch);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SequenceForRegularChannels_Get13thSequence, ADCx, ch);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SequenceForRegularChannels_Get12thSequence(ADC_TypeDef *ADCx){
	return ( Get5Bit(ADCx->SQR2, ADC_SQR2_SQ12_Pos) );
}

__STATIC_INLINE uint8_t ADC_SequenceForRegularChannels_Set12thSequence(ADC_TypeDef *ADCx, uint8_t ch){
	if(ch>17){return ADC_ERROR;}
	
	Write5Bit(ADCx->SQR2, ADC_SQR2_SQ12_Pos, ch);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SequenceForRegularChannels_Get12thSequence, ADCx, ch);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SequenceForRegularChannels_Get11thSequence(ADC_TypeDef *ADCx){
	return ( Get5Bit(ADCx->SQR2, ADC_SQR2_SQ11_Pos) );
}

__STATIC_INLINE uint8_t ADC_SequenceForRegularChannels_Set11thSequence(ADC_TypeDef *ADCx, uint8_t ch){
	if(ch>17){return ADC_ERROR;}
	
	Write5Bit(ADCx->SQR2, ADC_SQR2_SQ11_Pos, ch);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SequenceForRegularChannels_Get11thSequence, ADCx, ch);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SequenceForRegularChannels_Get10thSequence(ADC_TypeDef *ADCx){
	return ( Get5Bit(ADCx->SQR2, ADC_SQR2_SQ10_Pos) );
}

__STATIC_INLINE uint8_t ADC_SequenceForRegularChannels_Set10thSequence(ADC_TypeDef *ADCx, uint8_t ch){
	if(ch>17){return ADC_ERROR;}
	
	Write5Bit(ADCx->SQR2, ADC_SQR2_SQ10_Pos, ch);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SequenceForRegularChannels_Get10thSequence, ADCx, ch);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SequenceForRegularChannels_Get9thSequence(ADC_TypeDef *ADCx){
	return ( Get5Bit(ADCx->SQR2, ADC_SQR2_SQ9_Pos) );
}

__STATIC_INLINE uint8_t ADC_SequenceForRegularChannels_Set9thSequence(ADC_TypeDef *ADCx, uint8_t ch){
	if(ch>17){return ADC_ERROR;}
	
	Write5Bit(ADCx->SQR2, ADC_SQR2_SQ9_Pos, ch);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SequenceForRegularChannels_Get9thSequence, ADCx, ch);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SequenceForRegularChannels_Get8thSequence(ADC_TypeDef *ADCx){
	return ( Get5Bit(ADCx->SQR2, ADC_SQR2_SQ8_Pos) );
}

__STATIC_INLINE uint8_t ADC_SequenceForRegularChannels_Set8thSequence(ADC_TypeDef *ADCx, uint8_t ch){
	if(ch>17){return ADC_ERROR;}
	
	Write5Bit(ADCx->SQR2, ADC_SQR2_SQ8_Pos, ch);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SequenceForRegularChannels_Get8thSequence, ADCx, ch);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SequenceForRegularChannels_Get7thSequence(ADC_TypeDef *ADCx){
	return ( Get5Bit(ADCx->SQR2, ADC_SQR2_SQ7_Pos) );
}

__STATIC_INLINE uint8_t ADC_SequenceForRegularChannels_Set7thSequence(ADC_TypeDef *ADCx, uint8_t ch){
	if(ch>17){return ADC_ERROR;}
	
	Write5Bit(ADCx->SQR2, ADC_SQR2_SQ7_Pos, ch);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SequenceForRegularChannels_Get7thSequence, ADCx, ch);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SequenceForRegularChannels_Get6thSequence(ADC_TypeDef *ADCx){
	return ( Get5Bit(ADCx->SQR3, ADC_SQR3_SQ6_Pos) );
}

__STATIC_INLINE uint8_t ADC_SequenceForRegularChannels_Set6thSequence(ADC_TypeDef *ADCx, uint8_t ch){
	if(ch>17){return ADC_ERROR;}
	
	Write5Bit(ADCx->SQR3, ADC_SQR3_SQ6_Pos, ch);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SequenceForRegularChannels_Get6thSequence, ADCx, ch);
	#else
		return 0;
	#endif
}

