AliRezaJoodi/STM32_Exercises/_ExtraDrivers/Inc/stm32f1xx_bm_adc.h
__STATIC_INLINE uint8_t _SequenceForRegularChannels_Get5thSequence(ADC_TypeDef *ADCx){
	return ( Get5Bit(ADCx->SQR3, ADC_SQR3_SQ5_Pos) );
}

__STATIC_INLINE uint8_t ADC_SequenceForRegularChannels_Set5thSequence(ADC_TypeDef *ADCx, uint8_t ch){
	if(ch>17){return ADC_ERROR;}
	
	Write5Bit(ADCx->SQR3, ADC_SQR3_SQ5_Pos, ch);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SequenceForRegularChannels_Get5thSequence, ADCx, ch);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SequenceForRegularChannels_Get4thSequence(ADC_TypeDef *ADCx){
	return ( Get5Bit(ADCx->SQR3, ADC_SQR3_SQ4_Pos) );
}

__STATIC_INLINE uint8_t ADC_SequenceForRegularChannels_Set4thSequence(ADC_TypeDef *ADCx, uint8_t ch){
	if(ch>17){return ADC_ERROR;}
	
	Write5Bit(ADCx->SQR3, ADC_SQR3_SQ4_Pos, ch);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SequenceForRegularChannels_Get4thSequence, ADCx, ch);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SequenceForRegularChannels_Get3rdSequence(ADC_TypeDef *ADCx){
	return ( Get5Bit(ADCx->SQR3, ADC_SQR3_SQ3_Pos) );
}

__STATIC_INLINE uint8_t ADC_SequenceForRegularChannels_Set3rdSequence(ADC_TypeDef *ADCx, uint8_t ch){
	if(ch>17){return ADC_ERROR;}
	
	Write5Bit(ADCx->SQR3, ADC_SQR3_SQ3_Pos, ch);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SequenceForRegularChannels_Get3rdSequence, ADCx, ch);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SequenceForRegularChannels_Get2ndSequence(ADC_TypeDef *ADCx){
	return ( Get5Bit(ADCx->SQR3, ADC_SQR3_SQ2_Pos) );
}

__STATIC_INLINE uint8_t ADC_SequenceForRegularChannels_Set2ndSequence(ADC_TypeDef *ADCx, uint8_t ch){
	if(ch>17){return ADC_ERROR;}
	
	Write5Bit(ADCx->SQR3, ADC_SQR3_SQ2_Pos, ch);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SequenceForRegularChannels_Get2ndSequence, ADCx, ch);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SequenceForRegularChannels_Get1stSequence(ADC_TypeDef *ADCx){
	return ( Get5Bit(ADCx->SQR3, ADC_SQR3_SQ1_Pos) );
}

__STATIC_INLINE uint8_t ADC_SequenceForRegularChannels_Set1stSequence(ADC_TypeDef *ADCx, uint8_t ch){
	if(ch>17){return ADC_ERROR;}
	
	Write5Bit(ADCx->SQR3, ADC_SQR3_SQ1_Pos, ch);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SequenceForRegularChannels_Get1stSequence, ADCx, ch);
	#else
		return 0;
	#endif
}


/*
ADC_SMPR1, Bits 23:0
SMPx[2:0]: 	Channel x Sample time selection
						These bits are written by software to select the sample time individually for each channel.
						During sample cycles channel selection bits must remain unchanged.

						Note: ADC1 analog Channel16 and Channel 17 are internally connected to the temperature sensor and to VREFINT, respectively.
						Note: The recommended sampling time for the temperature sensor is 17.1 µs.
						Note: ADC2 analog input Channel16 and Channel17 are internally connected to VSS.
						Note: ADC3 analog inputs Channel14, Channel15, Channel16 and Channel17 are connected to VSS.

ADC_SMPR2, Bits 29:0
SMPx[2:0]: 	Channel x Sample time selection
						These bits are written by software to select the sample time individually for each channel.
						During sample cycles channel selection bits must remain unchanged.
						Note: ADC3 analog input Channel9 is connected to VSS.


						000: 1.5 cycles
						001: 7.5 cycles
						010: 13.5 cycles
						011: 28.5 cycles
						100: 41.5 cycles
						101: 55.5 cycles
						110: 71.5 cycles
						111: 239.5 cycles			
*/

#define ADC_SAMPLINGTIME_1CYCLE_5       	0b000U
#define ADC_SAMPLINGTIME_7CYCLE_5       	0b001U
#define ADC_SAMPLINGTIME_13CYCLE_5       	0b010U
#define ADC_SAMPLINGTIME_28CYCLE_5       	0b011U
#define ADC_SAMPLINGTIME_41CYCLE_5       	0b100U
#define ADC_SAMPLINGTIME_55CYCLE_5       	0b101U
#define ADC_SAMPLINGTIME_71CYCLE_5       	0b110U
#define ADC_SAMPLINGTIME_239CYCLE_5     	0b111U

__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh17(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR1, ADC_SMPR1_SMP17_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh17(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR1, ADC_SMPR1_SMP17_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh17, ADCx, mode);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh16(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR1, ADC_SMPR1_SMP16_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh16(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR1, ADC_SMPR1_SMP16_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh16, ADCx, mode);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh15(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR1, ADC_SMPR1_SMP15_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh15(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR1, ADC_SMPR1_SMP15_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh15, ADCx, mode);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh14(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR1, ADC_SMPR1_SMP14_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh14(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR1, ADC_SMPR1_SMP14_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh14, ADCx, mode);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh13(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR1, ADC_SMPR1_SMP13_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh13(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR1, ADC_SMPR1_SMP13_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh13, ADCx, mode);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh12(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR1, ADC_SMPR1_SMP12_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh12(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR1, ADC_SMPR1_SMP12_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh12, ADCx, mode);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh11(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR1, ADC_SMPR1_SMP11_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh11(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR1, ADC_SMPR1_SMP11_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh11, ADCx, mode);
	#else
		return 0;
	#endif
}

