AliRezaJoodi/STM32_Exercises/_ExtraDrivers/Inc/stm32f1xx_bm_adc.h
__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh10(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR1, ADC_SMPR1_SMP10_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh10(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR1, ADC_SMPR1_SMP10_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh10, ADCx, mode);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh9(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR2, ADC_SMPR2_SMP9_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh9(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR2, ADC_SMPR2_SMP9_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh9, ADCx, mode);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh8(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR2, ADC_SMPR2_SMP8_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh8(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR2, ADC_SMPR2_SMP8_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh8, ADCx, mode);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh7(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR2, ADC_SMPR2_SMP7_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh7(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR2, ADC_SMPR2_SMP7_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh7, ADCx, mode);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh6(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR2, ADC_SMPR2_SMP6_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh6(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR2, ADC_SMPR2_SMP6_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh6, ADCx, mode);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh5(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR2, ADC_SMPR2_SMP5_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh5(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR2, ADC_SMPR2_SMP5_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh5, ADCx, mode);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh4(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR2, ADC_SMPR2_SMP4_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh4(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR2, ADC_SMPR2_SMP4_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh4, ADCx, mode);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh3(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR2, ADC_SMPR2_SMP3_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh3(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR2, ADC_SMPR2_SMP3_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh3, ADCx, mode);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh2(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR2, ADC_SMPR2_SMP2_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh2(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR2, ADC_SMPR2_SMP2_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh2, ADCx, mode);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh1(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR2, ADC_SMPR2_SMP1_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh1(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR2, ADC_SMPR2_SMP1_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh1, ADCx, mode);
	#else
		return 0;
	#endif
}

__STATIC_INLINE uint8_t _SamplingTime_GetCycleFromCh0(ADC_TypeDef *ADCx){
	return ( Get3Bit(ADCx->SMPR2, ADC_SMPR2_SMP0_Pos) );
}

__STATIC_INLINE uint8_t ADC_SamplingTime_SetCycleForCh0(ADC_TypeDef *ADCx, uint8_t mode){	
	Write3Bit(ADCx->SMPR2, ADC_SMPR2_SMP0_Pos, mode);
	
	#ifdef TIMEOUT_INCLUDED
		return Timeout_ADC_WaitUntil(_SamplingTime_GetCycleFromCh0, ADCx, mode);
	#else
		return 0;
	#endif
}


//******************************************************************************
#define ADC_RANK1			1
#define ADC_RANK2			2
#define ADC_RANK3			3
#define ADC_RANK4			4
#define ADC_RANK5			5
#define ADC_RANK6			6
#define ADC_RANK7			7
#define ADC_RANK8			8
#define ADC_RANK9			9
#define ADC_RANK10		10
#define ADC_RANK11		11
#define ADC_RANK12		12
#define ADC_RANK13		13
#define ADC_RANK14		14
#define ADC_RANK15		15
#define ADC_RANK16		16

uint8_t ADC_SequenceForRegularChannels_SetSequence(ADC_TypeDef *ADCx, uint8_t rank, uint8_t ch);

uint8_t ADC_SamplingTime_SetCycle(ADC_TypeDef *ADCx, uint8_t ch, uint8_t cycle);

///void ADC_ConfigDefault1(ADC_TypeDef *ADCx);		//Single Mode
uint16_t ADC_SingleMode_Read(ADC_TypeDef *ADCx, uint8_t ch);
float ADC_ConvertValueToVolt(uint16_t value);
float ADC_ConvertValueToMiliVolt(uint16_t value);
float ADC_ConvertMiliVoltToInternalTemp(float mv);

#ifdef __cplusplus
}
#endif

#endif		// _STM32F1XX_BM_ADC_INCLUDED